libc0607/rtl8733bs-20250521/core/rtw_dfs.c
	band = rtw_freq2band(hi);

	for (i = 0; i < chset->chs_len; i++) {
		if (chset->chs[i].band != band)
			continue;
		if (!rtw_bch2freq(band, chset->chs[i].ChannelNum)) {
			rtw_warn_on(1);
			continue;
		}

		if (lo <= rtw_bch2freq(band, chset->chs[i].ChannelNum)
			&& rtw_bch2freq(band, chset->chs[i].ChannelNum) <= hi)
			chset->chs[i].cac_done = done;
	}
}

static void rtw_chset_update_cac_state_by_cch(struct rtw_chset *chset, u8 cch, u8 bw, bool done)
{
	u32 hi, lo;

	if (rtw_bcchbw_to_freq_range(BAND_ON_5G, cch, bw, &hi, &lo))
		rtw_chset_update_cac_state_by_freq(chset, hi, lo, done);
}

/**
 * rtw_chset_is_frange_require_cac - check cac_done according to the given @hi, @lo frequency into @chset
 * @chset: the given channel set
 * @hi: high frequency of checking range
 * @lo: low frequency of checking range
 * return: if all channel inside range require CAC (DFS channel and not CAC done)
 */
static bool rtw_chset_is_frange_require_cac(struct rtw_chset *chset, u32 hi, u32 lo)
{
	enum band_type band;
	int i;

	band = rtw_freq2band(hi);

	for (i = 0; i < chset->chs_len; i++) {
		if (chset->chs[i].band != band)
			continue;
		if (!(chset->chs[i].flags & RTW_CHF_DFS))
			continue;
		if (!rtw_bch2freq(band, chset->chs[i].ChannelNum)) {
			rtw_warn_on(1);
			continue;
		}
		if (lo <= rtw_bch2freq(band, chset->chs[i].ChannelNum)
			&& rtw_bch2freq(band, chset->chs[i].ChannelNum) <= hi
			&& !chset->chs[i].cac_done)
			return true;
	}

	return false;
}

static bool rtw_chset_is_cch_require_cac(struct rtw_chset *chset, u8 cch, u8 bw)
{
	u32 hi, lo;

	if (rtw_bcchbw_to_freq_range(BAND_ON_5G, cch, bw, &hi, &lo))
		return rtw_chset_is_frange_require_cac(chset, hi, lo);
	return false;
}

bool rtw_chset_is_bchbw_non_ocp(const struct rtw_chset *chset, enum band_type band, u8 ch, u8 bw, u8 offset)
{
	bool ret = _FALSE;
	u32 hi = 0, lo = 0;
	int i;

	if (rtw_bchbw_to_freq_range(band, ch, bw, offset, &hi, &lo) == _FALSE)
		goto exit;

	for (i = 0; i < chset->chs_len; i++) {
		if (chset->chs[i].band != band)
			continue;
		if (!rtw_bch2freq(band, chset->chs[i].ChannelNum)) {
			rtw_warn_on(1);
			continue;
		}

		if (!CH_IS_NON_OCP(&chset->chs[i]))
			continue;

		if (lo <= rtw_bch2freq(band, chset->chs[i].ChannelNum)
			&& rtw_bch2freq(band, chset->chs[i].ChannelNum) <= hi
		) {
			ret = _TRUE;
			break;
		}
	}

exit:
	return ret;
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY bool rtw_chset_is_chbw_non_ocp(const struct rtw_chset *chset, u8 ch, u8 bw, u8 offset)
{
	return rtw_chset_is_bchbw_non_ocp(chset, rtw_is_2g_ch(ch) ? BAND_ON_24G : BAND_ON_5G, ch, bw, offset);
}

RTW_FUNC_2G_5G_ONLY bool rtw_chset_is_ch_non_ocp(const struct rtw_chset *chset, u8 ch)
{
	return rtw_chset_is_chbw_non_ocp(chset, ch, CHANNEL_WIDTH_20, CHAN_OFFSET_NO_EXT);
}
#endif

bool rtw_chset_is_bch_non_ocp(const struct rtw_chset *chset, enum band_type band, u8 ch)
{
	return rtw_chset_is_bchbw_non_ocp(chset, band, ch, CHANNEL_WIDTH_20, CHAN_OFFSET_NO_EXT);
}

static u32 rtw_chset_get_bch_non_ocp_ms(const struct rtw_chset *chset, enum band_type band, u8 ch, u8 bw, u8 offset)
{
	int ms = 0;
	systime current_time;
	u32 hi = 0, lo = 0;
	int i;

	if (rtw_bchbw_to_freq_range(band, ch, bw, offset, &hi, &lo) == _FALSE)
		goto exit;

	current_time = rtw_get_current_time();

	for (i = 0; i < chset->chs_len; i++) {
		if (chset->chs[i].band != band)
			continue;
		if (!rtw_bch2freq(band, chset->chs[i].ChannelNum)) {
			rtw_warn_on(1);
			continue;
		}

		if (!CH_IS_NON_OCP(&chset->chs[i]))
			continue;

		if (lo <= rtw_bch2freq(band, chset->chs[i].ChannelNum)
			&& rtw_bch2freq(band, chset->chs[i].ChannelNum) <= hi
		) {
			if (rtw_systime_to_ms(chset->chs[i].non_ocp_end_time - current_time) > ms)
				ms = rtw_systime_to_ms(chset->chs[i].non_ocp_end_time - current_time);
		}
	}

exit:
	return ms;
}

/**
 * rtw_chset_update_non_ocp_ms_by_freq - update non_ocp_end_time according to the given @hi, @lo frequency into @ch_set
 * @chset: the given channel set
 * @hi: high frequency on which radar is detected
 * @lo: low frequency on which radar is detected
 * @ms: ms to add from now to update non_ocp_end_time, ms < 0 means use NON_OCP_TIME_MS
 */
static bool rtw_chset_update_non_ocp_ms_by_freq(struct rtw_chset *chset, u32 hi, u32 lo, int ms)
{
	enum band_type band;
	int i;
	bool updated = 0;

	band = rtw_freq2band(hi);

	for (i = 0; i < chset->chs_len; i++) {
		if (chset->chs[i].band != band)
			continue;
		if (!rtw_bch2freq(band, chset->chs[i].ChannelNum)) {
			rtw_warn_on(1);
			continue;
		}

		if (lo <= rtw_bch2freq(band, chset->chs[i].ChannelNum)
			&& rtw_bch2freq(band, chset->chs[i].ChannelNum) <= hi
		) {
			if (ms >= 0)
				chset->chs[i].non_ocp_end_time = rtw_get_current_time() + rtw_ms_to_systime(ms);
			else
				chset->chs[i].non_ocp_end_time = rtw_get_current_time() + rtw_ms_to_systime(NON_OCP_TIME_MS);
			if (chset->chs[i].non_ocp_end_time == RTW_NON_OCP_STOPPED)
				chset->chs[i].non_ocp_end_time++;
			updated = 1;
		}
	}

	return updated;
}

static bool rtw_chset_update_non_ocp_ms_by_band_cch(struct rtw_chset *chset, enum band_type band, u8 cch, u8 bw, int ms)
{
	u32 hi, lo;

	if (rtw_bcchbw_to_freq_range(band, cch, bw, &hi, &lo) == _FALSE)
		return _FALSE;

	return rtw_chset_update_non_ocp_ms_by_freq(chset, hi, lo, ms);
}

static bool rtw_chset_update_non_ocp_ms_by_band(struct rtw_chset *chset, enum band_type band, u8 ch, u8 bw, u8 offset, int ms)
{
	u32 hi, lo;

	if (rtw_bchbw_to_freq_range(band, ch, bw, offset, &hi, &lo) == _FALSE)
		return _FALSE;

	return rtw_chset_update_non_ocp_ms_by_freq(chset, hi, lo, ms);
}

static bool rtw_rfctl_chset_chk_non_ocp_finish_for_bchbw(struct rf_ctl_t *rfctl, enum band_type band, u8 ch, u8 bw, u8 offset)
{
	struct rtw_chset *chset = &rfctl->chset;
	RT_CHANNEL_INFO *chinfo;
	u8 cch;
	u8 *op_chs;
	u8 op_ch_num;
	int i;
	bool ret = 0;

	cch = rtw_get_center_ch_by_band(band, ch, bw, offset);

	if (!rtw_get_op_chs_by_bcch_bw(band, cch, bw, &op_chs, &op_ch_num))
		goto exit;

	for (i = 0; i < op_ch_num; i++) {
		if (0)
			RTW_INFO("%u,%u,%u,%u - cch:%u, bw:%u, op_ch:%u\n", band, ch, bw, offset, cch, bw, *(op_chs + i));
		chinfo = rtw_chset_get_chinfo_by_bch(chset, band, *(op_chs + i), true);
		if (!chinfo)
			break;
		if (CH_IS_NON_OCP_STOPPED(chinfo) || CH_IS_NON_OCP(chinfo))
			break;
	}

	if (op_ch_num != 0 && i == op_ch_num) {
		ret = 1;
		/* set to RTW_NON_OCP_STOPPED */
		for (i = 0; i < op_ch_num; i++) {
			chinfo = rtw_chset_get_chinfo_by_bch(chset, band, *(op_chs + i), true);
			chinfo->non_ocp_end_time = RTW_NON_OCP_STOPPED;
		}
		for (i = HW_BAND_0; i < HW_BAND_MAX; i++) /* single chset shared by all hwband */
			rtw_os_indicate_nop_finished(rfctl, i, band, cch, bw);
	}

