libc0607/rtl8733bs-20250521/core/rtw_dfs.c
cac_status_chk:

	if (!IS_CAC_STOPPED(rfctl)
		&& ((IS_UNDER_CAC(rfctl) && rfctl->cac_force_stop)
			|| !IS_CH_WAITING(rfctl)
			)
	) {
		_adapter *m_iface;

		rfctl->cac_start_time = rfctl->cac_end_time = RTW_CAC_STOPPED;
		rtw_chset_update_cac_state_by_cch(&rfctl->chset
			, rfctl->radar_detect_cch[hwband], rfctl->radar_detect_bw[hwband], true);
		rtw_dfs_hal_set_cac_status(dvobj, hwband, false);

		m_iface = rtw_mi_get_ap_mesh_iface_by_hwband(dvobj, hwband);
		if (m_iface) {
			if (!rtw_mi_check_fwstate_by_hwband(dvobj, hwband, WIFI_UNDER_LINKING|WIFI_UNDER_SURVEY)) {
				struct _ADAPTER_LINK *alink = rtw_get_adapter_link_by_hwband(m_iface, hwband);
				u8 do_rfk = _TRUE;
				enum band_type u_band;
				u8 u_ch, u_bw, u_offset;

				if (rtw_mi_get_bch_setting_union_by_hwband(dvobj, hwband, &u_band, &u_ch, &u_bw, &u_offset))
					set_bch_bwmode(m_iface, alink, u_band, u_ch, u_offset, u_bw, do_rfk);
				else
					rtw_warn_on(1);
			}
		} else
			RTW_ERR(FUNC_HWBAND_FMT" can't get ap/mesh iface\n", FUNC_HWBAND_ARG(hwband));

		rtw_os_indicate_cac_finished(rfctl, hwband, 0xFF
			, rfctl->radar_detect_cch[hwband], rfctl->radar_detect_bw[hwband]);
	}

set_timer:
	_set_timer(&rfctl->radar_detect_timer
		, rtw_dfs_hal_radar_detect_polling_int_ms(dvobj));

exit:
	return H2C_SUCCESS;
}

static u8 rtw_dfs_rd_cmd(struct dvobj_priv *dvobj, enum phl_band_idx hwband)
{
	struct cmd_obj *cmdobj;
	struct drvextra_cmd_parm *parm;
	_adapter *adapter = dvobj_get_primary_adapter(dvobj);
	struct cmd_priv *cmdpriv = &adapter->cmdpriv;
	u8 res = _FAIL;

	cmdobj = rtw_zmalloc(sizeof(struct cmd_obj));
	if (cmdobj == NULL)
		goto exit;

	parm = rtw_zmalloc(sizeof(struct drvextra_cmd_parm));
	if (parm == NULL) {
		rtw_mfree(cmdobj, sizeof(struct cmd_obj));
		goto exit;
	}

	parm->ec_id = DFS_RADAR_DETECT_WK_CID;
	parm->type = hwband;
	parm->size = 0;
	parm->pbuf = NULL;

	init_h2fwcmd_w_parm_no_rsp(cmdobj, parm, CMD_SET_DRV_EXTRA);
	CMD_OBJ_SET_HWBAND(cmdobj, hwband);
	res = rtw_enqueue_cmd(cmdpriv, cmdobj);

exit:
	return res;
}

static void rtw_dfs_rd_timer_hdl(void *ctx)
{
	struct rf_ctl_t *rfctl = (struct rf_ctl_t *)ctx;
	struct dvobj_priv *dvobj = rfctl_to_dvobj(rfctl);

	rtw_dfs_rd_cmd(dvobj, rfctl->radar_detect_hwband);
}
#endif /* CONFIG_DFS_MASTER */

#if CONFIG_DFS && CONFIG_IEEE80211_BAND_5GHZ
static void rtw_dfs_update_rd_range_status(struct rf_ctl_t *rfctl, u8 band_idx
	, u8 op_ch, enum channel_width op_bw, enum chan_offset op_offset, u32 rd_freq_hi, u32 rd_freq_lo, bool by_others)
{
#define RD_RANGE_OPCH_NUM_MAX (160 / 20)
#ifdef CONFIG_DFS_MASTER
	bool new_self_rd_ch = false;
	bool cover_non_ocp = op_ch && rtw_chset_is_bchbw_non_ocp(&rfctl->chset, BAND_ON_5G, op_ch, op_bw, op_offset);
#endif
	u8 cch = 0;
	enum channel_width bw = CHANNEL_WIDTH_MAX;

#ifndef CONFIG_DFS_MASTER
	if (rd_freq_hi && !by_others) {
		rtw_warn_on(1);
		rd_freq_hi = 0;
	}
#endif

	if (rd_freq_hi) {
		cch = rtw_freq2ch((rd_freq_hi + rd_freq_lo) / 2);
		bw = rtw_frange_to_bw(rd_freq_hi, rd_freq_lo);
		rtw_warn_on(cch == 0);
		rtw_warn_on(bw == CHANNEL_WIDTH_MAX);
	}

#ifdef CONFIG_DFS_MASTER
	if (rfctl->radar_detect_cch[band_idx] != cch
		|| rfctl->radar_detect_bw[band_idx] != bw
	) {
		/* coverage range changed */
		u8 *op_chs;
		u8 op_ch_num;
		u8 rd_cch;
		enum channel_width rd_bw;
		u8 i, j, k;

		if (rfctl->radar_detect_cch[band_idx]) {
			u8 clr_chs[RD_RANGE_OPCH_NUM_MAX];

			/* init clr_chs from original coverage of this hwband */
			if (!rtw_get_op_chs_by_bcch_bw(BAND_ON_5G
				, rfctl->radar_detect_cch[band_idx], rfctl->radar_detect_bw[band_idx], &op_chs, &op_ch_num)
			) {
				RTW_WARN(FUNC_HWBAND_FMT" rtw_get_op_chs_by_bcch_bw() fail on cch:%u bw:%u\n", FUNC_HWBAND_ARG(band_idx)
					, rfctl->radar_detect_cch[band_idx], rfctl->radar_detect_bw[band_idx]);
				rtw_warn_on(1);
				goto handle_add_chs;
			}
			_rtw_memset(clr_chs, 0, RD_RANGE_OPCH_NUM_MAX);
			for (i = 0; i < op_ch_num; i++)
				clr_chs[i] = op_chs[i];

			/* remove op chs of new coverages from clr_chs */
			for (i = HW_BAND_0; i < HW_BAND_MAX; i++) {
				if (i == band_idx && cch) {
					rd_cch = cch;
					rd_bw = bw;
				} else if (i != band_idx && rfctl->radar_detect_cch[i]) {
					rd_cch = rfctl->radar_detect_cch[i];
					rd_bw = rfctl->radar_detect_bw[i];
				} else
					continue;

				if (!rtw_get_op_chs_by_bcch_bw(BAND_ON_5G, rd_cch, rd_bw, &op_chs, &op_ch_num)) {
					RTW_WARN(FUNC_HWBAND_FMT" rtw_get_op_chs_by_bcch_bw() fail on cch:%u bw:%u\n"
						, FUNC_HWBAND_ARG(i), rd_cch, rd_bw);
					rtw_warn_on(1);
					continue;
				}
				for (j = 0; j < RD_RANGE_OPCH_NUM_MAX; j++)
					for (k = 0; k < op_ch_num; k++)
						if (clr_chs[j] == op_chs[k])
							clr_chs[j] = 0;
			}

			/* clear CAC_DONE of clr_chs */
			rtw_chset_update_cac_state_of_chs(&rfctl->chset, clr_chs, RD_RANGE_OPCH_NUM_MAX, false);
		}

handle_add_chs:
		if (cch && !by_others && !cover_non_ocp) {
			u8 add_chs[RD_RANGE_OPCH_NUM_MAX];

			/* init add_chs from new coverage of this hwband */
			if (!rtw_get_op_chs_by_bcch_bw(BAND_ON_5G, cch, bw, &op_chs, &op_ch_num)) {
				RTW_WARN(FUNC_HWBAND_FMT" rtw_get_op_chs_by_bcch_bw() fail on cch:%u bw:%u\n"
					, FUNC_HWBAND_ARG(band_idx), cch, bw);
				rtw_warn_on(1);
				goto update_ch_cac;
			}
			_rtw_memset(add_chs, 0, RD_RANGE_OPCH_NUM_MAX);
			for (i = 0; i < op_ch_num; i++)
				add_chs[i] = op_chs[i];

			/* remove op chs of original coverages from add_chs */
			for (i = HW_BAND_0; i < HW_BAND_MAX; i++) {
				if (rfctl->radar_detect_cch[i]) {
					rd_cch = rfctl->radar_detect_cch[i];
					rd_bw = rfctl->radar_detect_bw[i];
				} else
					continue;

				if (!rtw_get_op_chs_by_bcch_bw(BAND_ON_5G, rd_cch, rd_bw, &op_chs, &op_ch_num)) {
					RTW_WARN(FUNC_HWBAND_FMT" rtw_get_op_chs_by_bcch_bw() fail on cch:%u bw:%u\n"
						, FUNC_HWBAND_ARG(i), rd_cch, rd_bw);
					rtw_warn_on(1);
					continue;
				}
				for (j = 0; j < RD_RANGE_OPCH_NUM_MAX; j++)
					for (k = 0; k < op_ch_num; k++)
						if (add_chs[j] == op_chs[k])
							add_chs[j] = 0;
			}

