libc0607/rtl8733bs-20250521/core/rtw_dfs.c
		_RTW_PRINT_SEL(sel, "\n");
	}
}
#endif /* CONFIG_DFS && CONFIG_IEEE80211_BAND_5GHZ */

#ifdef CONFIG_DFS_MASTER
void rtw_dfs_rd_en_dec_update(struct dvobj_priv *dvobj, enum phl_band_idx hwband)
{
	rtw_dfs_rd_en_decision(dvobj, hwband, NULL, NULL, MLME_ACTION_NONE, 0);
}

u8 rtw_dfs_rd_en_decision_cmd(struct dvobj_priv *dvobj, enum phl_band_idx hwband)
{
	struct cmd_obj *cmdobj;
	struct drvextra_cmd_parm *parm;
	_adapter *adapter = dvobj_get_primary_adapter(dvobj);
	struct cmd_priv *cmdpriv = &adapter->cmdpriv;
	u8 res = _FAIL;

	cmdobj = rtw_zmalloc(sizeof(struct cmd_obj));
	if (cmdobj == NULL)
		goto exit;

	parm = rtw_zmalloc(sizeof(struct drvextra_cmd_parm));
	if (parm == NULL) {
		rtw_mfree(cmdobj, sizeof(struct cmd_obj));
		goto exit;
	}

	parm->ec_id = DFS_RADAR_DETECT_EN_DEC_WK_CID;
	parm->type = hwband;
	parm->size = 0;
	parm->pbuf = NULL;

	init_h2fwcmd_w_parm_no_rsp(cmdobj, parm, CMD_SET_DRV_EXTRA);
	CMD_OBJ_SET_HWBAND(cmdobj, hwband);
	res = rtw_enqueue_cmd(cmdpriv, cmdobj);

exit:
	return res;
}

void rtw_indicate_cac_state_on_bss_start(_adapter *adapter)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

	if (IS_UNDER_CAC(rfctl)) {
		u8 rd_hwband = rfctl->radar_detect_hwband;

		if (rtw_iface_is_operate_at_hwband(adapter, rd_hwband))
			rtw_os_indicate_cac_started(rfctl, rd_hwband, BIT(adapter->iface_id)
				, rfctl->radar_detect_cch[rd_hwband], rfctl->radar_detect_bw[rd_hwband]);
	} else {
		u8 band_idx;

		for (band_idx = HW_BAND_0; band_idx < HW_BAND_MAX; band_idx++) {
			if (!rfctl->radar_detect_by_others[band_idx])
				continue;
			if (!rtw_iface_is_operate_at_hwband(adapter, band_idx))
				continue;
			rtw_os_force_cac_finished(rfctl, band_idx, BIT(adapter->iface_id)
				, rfctl->radar_detect_cch[band_idx], rfctl->radar_detect_bw[band_idx]);
		}
	}
}

void rtw_indicate_cac_state_on_bss_stop(_adapter *adapter)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

	if (IS_UNDER_CAC(rfctl)) {
		u8 rd_hwband = rfctl->radar_detect_hwband;

		if (rtw_iface_is_operate_at_hwband(adapter, rd_hwband))
			rtw_os_indicate_cac_aborted(rfctl, rd_hwband, BIT(adapter->iface_id)
				, rfctl->radar_detect_cch[rd_hwband], rfctl->radar_detect_bw[rd_hwband]);
	}
}
#endif /* CONFIG_DFS_MASTER */

#ifdef CONFIG_RTW_ACS
#include <hal_data.h>
#endif

/* choose channel with shortest waiting (non ocp + cac) time */
static bool rtw_choose_shortest_waiting_ch(struct rf_ctl_t *rfctl
	, enum band_type sel_band, u8 sel_ch, u8 max_bw, enum chan_offset sel_offset
	, enum band_type *dec_band, u8 *dec_ch, u8 *dec_bw, u8 *dec_offset
	, u8 e_flags, u8 d_flags, enum band_type cur_band, u8 cur_ch, enum chan_offset cur_offset
	, bool by_int_info, u8 mesh_only)
{
#ifndef DBG_CHOOSE_SHORTEST_WAITING_CH
#define DBG_CHOOSE_SHORTEST_WAITING_CH 0
#endif
	struct dvobj_priv *dvobj = rfctl_to_dvobj(rfctl);
	struct rtw_chset *chset = &rfctl->chset;
#ifdef CONFIG_RTW_ACS
	HAL_DATA_TYPE *hal_data = GET_HAL_DATA(dvobj_get_primary_adapter(dvobj));
#endif
	struct registry_priv *regsty = dvobj_to_regsty(dvobj);
	enum band_type band;
	u8 ch, bw, offset, r_offset[2], r_offset_num;
	enum band_type band_c = BAND_MAX;
	u8 ch_c = 0, bw_c = 0, offset_c = 0;
	int i, j;
	u32 min_waiting_ms = 0;
	u16 int_factor_c = 0;
	bool within_same_band = rfctl->ch_sel_within_same_band;

	if (!dec_ch || !dec_bw || !dec_offset) {
		rtw_warn_on(1);
		return _FALSE;
	}

	RTW_INFO("%s: sel_ch:%s-%u(%u) max_bw:%u e_flags:0x%02x d_flags:0x%02x cur_ch:%s-%u(%u) within_sb:%d%s%s\n"
		, __func__, band_str(sel_band), sel_ch, sel_offset, max_bw, e_flags, d_flags
		, band_str(cur_band), cur_ch, cur_offset, within_same_band
		, by_int_info ? " int" : "", mesh_only ? " mesh_only" : "");

	if (sel_band != BAND_MAX && rtw_rfctl_is_regu_forbid_bss(rfctl, sel_band))
		goto exit;
	if (sel_band == BAND_MAX && within_same_band && rtw_rfctl_is_regu_forbid_bss(rfctl, cur_band)) {
		RTW_INFO("%s: cancel within_sb because REGU_FORBID for %s BSS", __func__, band_str(cur_band));
		within_same_band = false;
	}

	/* full search and narrow bw judegement first to avoid potetial judegement timing issue */
	for (bw = CHANNEL_WIDTH_20; bw <= max_bw; bw++) {
		if (!hal_is_bw_support(dvobj_get_primary_adapter(dvobj), bw))
			continue;

		for (i = 0; i < chset->chs_len; i++) {
			u32 non_ocp_ms = 0;
			u32 cac_ms = 0;
			u32 waiting_ms = 0;
			u16 int_factor = 0;
			bool dfs_ch;

			if (chset->chs[i].flags & RTW_CHF_DIS)
				continue;

			band = chset->chs[i].band;
			ch = chset->chs[i].ChannelNum;
			if (rtw_rfctl_is_regu_forbid_bss(rfctl, band))
				continue;
			if (sel_band != BAND_MAX) {
				if (band != sel_band)
					continue;
			} else if (within_same_band && cur_band != band)
				continue;
			if (sel_ch) {
				if (ch != sel_ch)
					continue;
			}

			if (band == BAND_ON_24G) {
				if (bw > REGSTY_BW_2G(regsty))
					continue;
			#if CONFIG_IEEE80211_BAND_5GHZ
			} else if (band == BAND_ON_5G) {
				if (bw > REGSTY_BW_5G(regsty))
					continue;
			#endif
			#if CONFIG_IEEE80211_BAND_6GHZ
			} else if (band == BAND_ON_6G) {
				if (bw > REGSTY_BW_6G(regsty))
					continue;
			#endif
			}

			if (mesh_only && band == BAND_ON_24G && ch >= 5 && ch <= 9 && bw > CHANNEL_WIDTH_20)
				continue;

			if (sel_offset == CHAN_OFFSET_NO_EXT || bw == CHANNEL_WIDTH_20) {
				if (!rtw_get_offsets_by_bchbw(band, ch, bw, r_offset, &r_offset_num))
					continue;
			} else {
				r_offset[0] = sel_offset;
				r_offset_num = 1;
			}

			for (j = 0; j < r_offset_num; j++) {
				offset = r_offset[j];
				if (!rtw_chset_is_bchbw_valid(chset, band, ch, bw, offset, 0, 0))
					continue;

				if ((e_flags & RTW_CHF_DFS) || (d_flags & RTW_CHF_DFS)) {
					dfs_ch = rtw_chset_is_dfs_bchbw(chset, band, ch, bw, offset);
					if (((e_flags & RTW_CHF_DFS) && !dfs_ch)
						|| ((d_flags & RTW_CHF_DFS) && dfs_ch))
						continue;
				}

				#ifdef CONFIG_DFS_MASTER
				waiting_ms = rtw_get_ch_waiting_ms(rfctl, band, ch, bw, offset, &non_ocp_ms, &cac_ms);
				#endif

				#ifdef CONFIG_RTW_ACS
				if (by_int_info) {
					/* for now, consider only primary channel */
					int_factor = hal_data->acs.interference_time[i];
				}
				#endif

				if (DBG_CHOOSE_SHORTEST_WAITING_CH)
					RTW_INFO("%s:%s,%u,%u,%u %u(non_ocp:%u, cac:%u), int:%u\n"
						, __func__, band_str(band), ch, bw, offset, waiting_ms, non_ocp_ms, cac_ms, int_factor);

				if (ch_c == 0
					/* first: smaller wating time */
					|| min_waiting_ms > waiting_ms
					/* then: less interference */
					|| (min_waiting_ms == waiting_ms && int_factor_c > int_factor)
					/* then: wider bw */
					|| (min_waiting_ms == waiting_ms && int_factor_c == int_factor && bw > bw_c)
					/* if all condition equal, same channel&offset -> same channel -> same band prefer */
					|| (min_waiting_ms == waiting_ms && int_factor_c == int_factor && bw == bw_c
						&& (((cur_band != band_c || cur_ch != ch_c || cur_offset != offset_c)
								&& (cur_band == band && cur_ch == ch && cur_offset == offset))
							|| ((cur_band != band_c || cur_ch != ch_c) && (cur_band == band && cur_ch == ch))
							|| (cur_band != band_c && cur_band == band))
						)
				) {
					band_c = band;
					ch_c = ch;
					bw_c = bw;
					offset_c = offset;
					min_waiting_ms = waiting_ms;
					int_factor_c = int_factor;
				}
			}
		}
	}

